{"data":{"site":{"siteMetadata":{"title":"J. Pedro Ribeiro","author":"J. Pedro Ribeiro"}},"markdownRemark":{"id":"d7f53eeb-da74-516c-bd98-958d5ab2ca90","excerpt":"Side projects are important for every professional. It takes your mind away from day-to-day work and let you explore and go further without the usual…","html":"<p>Side projects are important for every professional. It takes your mind away from day-to-day work and let you explore and go further without the usual constraints. For <strong>web professionals</strong> it usually means using brand new technology either to learn or to build something for the community to see.</p>\n<p>The problem with <strong>side projects</strong> is that they require time to build and maintain. My opinion is that they should not be treated as a second job or the fun will fade quickly. From concept to first draft, it should not consume you too much time that it becomes a burden. That is why I think the ideology of ”<em>done is beautiful</em>” fits perfectly for these kind of situations.</p>\n<h2>“If you build it, they will come”</h2>\n<p>Side projects are not meant to me perfect. At least not at first. So why not put it live in the first iteration, without all the extra features you initially thought? Trying too hard to make it perfect at first will only bloat the project and delay its release, postponing the pleasure of getting <strong>feedback</strong> and comments from users and visitors.</p>\n<p>We tend to take side projects very <strong>personal</strong> because, well… they are! However, what is perfect for us today might be lame tomorrow and all that time you spent adding <strong>unnecessary features</strong> will be for nothing. The quicker your site is up, more eager you will be to refresh its content and update it.</p>\n<h2>It’s ok to be imperfect</h2>\n<p>The good thing about side projects is the fact that we can make all mistakes we want. Update are easy and we can change them whenever we want.</p>\n<p>I made a small <a href=\"http://youtweetintome.jpedroribeiro.com/\" title=\"You Tweetin&#x27; To Me?\">site that collects movie reviews that I often tweets</a>. It’s not perfect and I would change a lot of things in it (and I will!) but for now it’s ok! It fulfills the necessity I had and my friends gave me great feedback. I did not spend too much time and had a great time building it. As should every side project.</p>","frontmatter":{"title":"Done Is Beautiful","date":"October 14, 2012"}}},"pageContext":{"slug":"/2012/10/done-is-beautiful/","previous":{"fields":{"slug":"/2012/08/vertically-centering-images-with-html-css/"},"frontmatter":{"title":"Vertically Centering Images with HTML & CSS"}},"next":{"fields":{"slug":"/2012/11/finding-a-job-in-web-design-and-development/"},"frontmatter":{"title":"Finding a job in web design and development"}}}}