{"data":{"site":{"siteMetadata":{"title":"J. Pedro Ribeiro","author":"J. Pedro Ribeiro"}},"markdownRemark":{"id":"b4c75619-1c65-5035-a4ed-49db5bfce882","excerpt":"A couple months ago I was approached by a book publishing company. They found this website through one of my  book review posts  and wanted me to be part of the…","html":"<p>A couple months ago I was approached by a book publishing company. They found this website through one of my <a href=\"http://jpedroribeiro.com/category/book-reviews/\">book review posts</a> and wanted me to be part of the <strong>technical review</strong> team of a new book they are releasing.</p>\n<h2>Curiosity and challenge</h2>\n<p>I’ve been doing book reviews for a while and thought it sounded like a natural evolution for this ‘hobby’. Without thinking twice I said yes.</p>\n<p>The subject of the book was very close to me: <strong>responsive web design</strong> with <a href=\"http://jpedroribeiro.com/tag/html/\">HTML5</a> and <a href=\"http://jpedroribeiro.com/tag/css/\">CSS3</a>. And it was aimed for beginners. Now, this changes things a little as you have to keep in mind the target audience.</p>\n<h2>The learning curve</h2>\n<p>As a <strong>technical reviewer</strong> you have to make sure the code and techniques are on spot and make sense with the proposed topics. As we all know, there are a dozen ways of achieving the same outcome in <strong>web development</strong>, so you have to keep your personal preferences aside while reviewing someone else’s work. And, being a book for beginners, you also have to suggest and indicate the easiest path to take whilst maintaining the reader interested.</p>\n<h2>Job done</h2>\n<p>Eight chapters later and it was done.</p>\n<p>It is more time consuming that you might think, but it’s a very pleasant experience. There is so much to learn by reading other people’s point of view on a subject and their approach to find a solution. And trying to make sure that that solution, not yours, works, it’s challenging.</p>\n<p>Gratifying experience. Hope to do more of that in the furure.</p>\n<p><em>PS: A new post will come as soon as the book is released.</em></p>","frontmatter":{"title":"Being a Technical Book Reviewer","date":"July 05, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2015/07/being-technical-book-reviewer/","previous":{"fields":{"slug":"/2014/10/book-review-expert-javascript/"},"frontmatter":{"title":"Book Review: Expert JavaScript","tags":null}},"next":{"fields":{"slug":"/2015/08/baseliner-my-first-chrome-extension/"},"frontmatter":{"title":"Baseliner: My First Chrome Extension","tags":null}}}}