{"data":{"site":{"siteMetadata":{"title":"J. Pedro Ribeiro","author":"J. Pedro Ribeiro"}},"markdownRemark":{"id":"fba765a0-d260-5d0b-901e-18c93f65a768","excerpt":"For the past 2 years, my work has had a focus on delivering  fast experiences  on the web. I’ve also kept an eye on any article, tweet or  Meetup  that would…","html":"<p>For the past 2 years, my work has had a focus on delivering <strong>fast experiences</strong> on the web. I’ve also kept an eye on any article, tweet or <a href=\"https://www.meetup.com/London-Web-Performance-Group/\">Meetup</a> that would mention performance. It was a job requirement back then, now it’s something I’m quite passionate about.</p>\n<h2>The Book</h2>\n<p>Which brings me to this <a href=\"http://jpedroribeiro.com/category/book-reviews/\">book</a>, <a href=\"https://www.manning.com/books/web-performance-in-action\">Web Performance In Action</a>, by <a href=\"https://twitter.com/malchata\">Jeremy L. Wagner</a>. It’s a very thorough collection of information on how to develop fast websites, from the best way to load <strong>fonts</strong> to techniques that cater for <strong>HTTP/2</strong>.</p>\n<p>With my years of experience in this area I can honestly say that this book is more suitable for intermediate developers. If you are a beginner, you will still find plenty of tutorials to follow and implement without much effort - there are enough links to ready made solutions that will suit most scenarios and use cases. For an advanced user, it might be more of the same.</p>\n<h2>Some Highlights</h2>\n<p>Right in the first chapters of the book, the author explain how to use <strong>Chrome Dev Tools</strong> to properly investigate <strong>performance issues</strong>. To me this was one of the highlights of the book. It’s very well explained and give the readers a good set of tools to use throughout the book.</p>\n<p>Another highlight was the chapter on <a href=\"https://developers.google.com/web/fundamentals/getting-started/primers/service-workers\">Service Workers</a>. With <a href=\"https://twitter.com/webmaxru/status/893027996659060738\">the news that Safari is intending to implement this technology</a>, it’s good to see the effort in educating more developers about it.</p>\n<p>But most of all, the <strong>best chapter</strong> in my opinion was the one regarding <a href=\"https://http2.github.io/\">HTTP/2</a>. It manages to summarize a lot of information in a very easy to read manner. If you never heard of <em>header compression</em>, <em>head-of-line-blocking</em>, or <em>SSL</em>, then this is when you will become familiarized with these terms and understand the improvements this new version of the protocol is bringing the to web.</p>","frontmatter":{"title":"Book Review: Web Performance In Action","date":"August 20, 2017"}}},"pageContext":{"slug":"/2017/08/book-review-web-performance-in-action/","previous":{"fields":{"slug":"/2016/12/progressive-web-apps/"},"frontmatter":{"title":"Progressive Web Apps"}},"next":{"fields":{"slug":"/2018/01/accessibility-tests-with-pa11y-node/"},"frontmatter":{"title":"Accessibility Tests with Pa11y & Node"}}}}