{"data":{"site":{"siteMetadata":{"title":"J. Pedro Ribeiro","author":"J. Pedro Ribeiro"}},"markdownRemark":{"id":"cc29fa0b-6c69-581f-872e-461cd0935ff1","excerpt":"Just recently finished  Zero - The Biography of a Dangerous Idea , by Charles Seife.  I definitely recommend this book (a  5-star  rating on  my GoodReads ). It…","html":"<p><a style=\"box-shadow: none\" target=\"_blank\" href=\"https://www.amazon.co.uk/gp/product/0285635948/ref=as_li_tl?ie=UTF8&camp=1634&creative=6738&creativeASIN=0285635948&linkCode=as2&tag=jpedroribeiro-21&linkId=b11f85740c004218407471c8f2881507\"><img border=\"0\" src=\"//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0285635948&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=jpedroribeiro-21\" style=\"margin:0 auto; display: block\" ></a></p>\n<p>Just recently finished <a href=\"https://amzn.to/329JLW9\">Zero - The Biography of a Dangerous Idea</a>, by Charles Seife. </p>\n<p>I definitely recommend this book (a <strong>5-star</strong> rating on <a href=\"https://www.goodreads.com/user/show/3186522-j-pedro-ribeiro\">my GoodReads</a>). It’s not too technical, gives you a deep historical background and in general felt like a nostalgic stroll back to my high school days.   </p>\n<p>Here I share my <em>highlights</em> on this blog’s first <a href=\"https://www.jpedroribeiro.com/tag/book-notes/\">Book Notes</a> edition: </p>\n<ol>\n<li>In English, eleven and twelve seem to be <em>derived</em> from “one over [ten]” and “two over [ten]”, while thirteen, fourteen, fifteen and so on are <em>contractions</em> of “three and ten”, “four and ten” and “five and ten”. <code class=\"language-text\">(p.8)</code></li>\n<li>Dividing by zero once - just one time - allows you to prove, mathematically, <strong>anything in the universe</strong>. You can prove that 1 + 1 = 42. <code class=\"language-text\">(p.23)</code></li>\n<li>…this means that the twenty-first century - and the third millennium - <strong>begins in the year 2001</strong>. Everybody celebrated the turn of the millennium on the wrong date. Even the <strong>Royal Greenwich Observatory</strong>, the official keeper of the world’s time and arbiter of all things chronological, planned to be swamped by the revelers. <code class=\"language-text\">(p.57)</code></li>\n<li><em>Islam</em> would take zero from <em>India</em> - and the <em>West</em> would eventually take it from Islam. <code class=\"language-text\">(p.72)</code></li>\n<li>Pythagoras had noticed that nature seemed to be governed by the <strong>golden ratio</strong>. <code class=\"language-text\">(p.79)</code></li>\n<li><em>“there is no square root of a negative number, for a negative number is not a square”</em> / When you square a positive number you get a positive number, when you square a negative number you get a positive number, when you square zero you get zero. <code class=\"language-text\">(p.154)</code></li>\n<li>Einstein stated that if a number of people watch the same phenomenon - say, the flight of a raven towards a tree, <em>the laws of physics</em> are the same for each observer. If you compare the notes of a person on the ground and a person on a train moving parallel to the raven, they would disagree about the speed of the raven and the tree. But the eventual outcome of the flight is the same. Both observers agree on the final result, though they might disagree about some of the details. <strong>This is the principle of relativity</strong>. <code class=\"language-text\">(p.176)</code></li>\n<li>Not only does <strong>time change with speed</strong>, so do length and mass. As objects speed up, they get shorter and heavier.  <code class=\"language-text\">(p.177)</code></li>\n<li>However, <strong>zero is too powerful even for nature</strong>. When Einstein extended the theory of relativity to include gravity, he did not suspect that his new equation - the general theory of relativity - would describe the ultimate and the <strong>worst infinity of them all: the black hole</strong>. <code class=\"language-text\">(p.178)</code></li>\n<li>Space and time are like a <strong>gigantic rubber sheet</strong>. Planets, stars, and everything else sit on that sheet, distorting it slightly. <strong>That distortion - the curvature caused by objects sitting on the sheet - is gravity</strong>. […] Earth is simply rolling around in the dimple that the sun makes in the rubber sheet. <code class=\"language-text\">(p.179)</code></li>\n<li>All that scientists know is the cosmos was spawned from nothing, and will return to the nothing from whence it came. <strong>The universe begins and ends with zero</strong>. <code class=\"language-text\">(p.215)</code></li>\n</ol>\n<iframe style=\"width:120px;height:240px;\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" frameborder=\"0\" src=\"//ws-eu.amazon-adsystem.com/widgets/q?ServiceVersion=20070822&OneJS=1&Operation=GetAdHtml&MarketPlace=GB&source=ac&ref=tf_til&ad_type=product_link&tracking_id=jpedroribeiro-21&marketplace=amazon&region=GB&placement=0285635948&asins=0285635948&linkId=7c067a7ae4ed8401465de4c3b7a7d571&show_border=true&link_opens_in_new_window=true&price_color=333333&title_color=0066c0&bg_color=ffffff\"></iframe>","frontmatter":{"title":"Book Notes #1 - Zero: The biography of a dangerous idea","date":"October 12, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019/10/book-notes-1-zero-the-biography-of-a-dangerous-idea/","previous":{"fields":{"slug":"/2019/06/beer-log-1-hawkshead-brewery/"},"frontmatter":{"title":"Beer Log #1 - Hawkshead Brewery","tags":["beer","taproom","lake district","hiking"]}},"next":null}}